# RunPickClrFromPal

## Description
Picks a color from a color palette

```pascal
FUNCTION RunPickClrFromPal(
				VAR filename : STRING;
				VAR index    : LONGINT): BOOLEAN;
```

```python
def vs.RunPickClrFromPal():
    return (BOOLEAN, filename, index)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|filename|STRING|   |
|index|LONGINT|   |

## Version
Availability: from Vectorworks 2013

## Category
* Color